export const tabsList = [
    {
        label: "热榜",
        value: "01"
    },
    {
        label: "前端",
        value: "02"
    },
    {
        label: "PHP",
        value: "03"
    },
    {
        label: "JAVA",
        value: "04"
    },
    {
        label: "Python",
        value: "05"
    },
    {
        label: "程序人生",
        value: "06"
    },
    {
        label: "数据库",
        value: "07"
    },
]

export const hotListData = [
    {
        0: [
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者---------------",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
        ]
    },
    {
        1: [
            {
                title: "1我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者---------------",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
        ]
    },
    {
        2: [
            {
                title: "2我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者---------------",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
        ]
    },
    {
        3: [
            {
                title: "3我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者---------------",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
        ]
    },
    {
        4: [
            {
                title: "4我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者---------------",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
        ]
    },
    {
        5: [
            {
                title: "5我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者---------------",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
        ]
    },
    {
        6: [
            {
                title: "6我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者---------------",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
            {
                title: "我是CSDN最硬核坐着，谁赞成，谁反对",
                detail: "也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者--也许是现在，也许是未来，我是全网最硬核的坐着，最值得爱学习爱编程的再在们关注的作者",
                author: "兔老大RabbitMQ",
                hot: "280000",
                value: "01"
            },
        ]
    },

]



